// Напишите программу, которая на вход принимает число и выдает его квадрат

Console.Write("Веедите число: ");
int i = int.Parse(Console.ReadLine() ??"0");
int n = i * i;
System.Console.WriteLine($"Квадрат числа {i} = {n}");